[
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 2,
    "username": "shenut detuyatu",
    "details": "Constant lag, constant freezing, constant white screen, low chance of getting a 3 star. The game is decent, combat feels similar to E7, the game is generous enough to satisfy most new players. Although one thing I have to say is that; optimize your game more. I'm running it in Infinix Note 12, which is enough to run ZZZ smoothly without any lags, as well as run HSR in medium resolution. I run this game with low resolution and the anti-processing is off. Still has white screens and a little lags."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 1,
    "username": "Ty Mc",
    "details": "I have to give a poor rating. I love this game- I really do. However for the past 2 weeks, maybe more, I've had to re-equip EVERY character I have as I start the game. Also, whenever I refin or power up said gear, it vanishes from the character and from the gear list. I have to log out, reequip, and repower up. Ever. Damn. Time. This isn't acceptable. This game is old enough that this shouldn't be an issue. Update: s23 ultra device"
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 2,
    "username": "julian gomez",
    "details": "My rating would be higher cuz there's a lot of upside with this. Like Eng dub,decent gameplay,story isn't too bad, and easy enough to farm. The rating is cuz this game is brutal to new players, every event is very hard and every stage you go the enemies lvls just get way higher. I can't even finish an event cuz the enemies just get too hard too fast. The same kinda goes for story but not as bad. You can either wait for strength and miss events or pay and play. And skins cost a lot of $."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 5,
    "username": "Neomi Calvario Sas",
    "details": "Very nice graphics, though it doesn't kill your phone. The gacha system is pretty tough, but the 2 star characters aren't completely useless till mid game. It one of the better turn based RPG, the gameplay is smooth. The UI isn't too crowded either. The character designs are pretty neat, it's not overly reliant on fanservice to sell their art. The story is pretty generic, but the game does well and it adds character to an otherwise overused trope. The game's generous towards free to play users."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 5,
    "username": "Lachlan Joliffe",
    "details": "This game is amazing if you are into Turn Based RPGs/Anime Games with a gacha system. So much to do, I have barely scratched the surface and I am hooked. Beautiful graphics, interesting story, characters and voice acting. The Battle scenes are awesome, love the individual animations for each hero and pulling heros isn't difficult to the point you feel like you have to spend money. INCREDIBLE WORK FROM THE DEVS. Wish I knew about this game sooner!"
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 2,
    "username": "Raiyyan Maniago",
    "details": "Everytime I exit, game keeps logging me out of my account. When I try to login with the birth year thingy (which is weird, just use my account???) it won't enter. Character designs are pretty basic (big booba lady) with only a few ACTUALLY GOOD designs standing out. Animations are decent, facial expressions are somewhat expressive, the character proportions are horrendous to look at tho which makes the game look cheap."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 5,
    "username": "Kyle Straughn",
    "details": "Been playing since launch. They fixed all the issues the game had. Spent zero dollars and have gotten EVERY banner character so far. Wildly FTP. Crazy generous rewards. Some of the best S3 animation skills I've ever seen in a mobile game and dont even get me started on the quality of the character models. This game is top-tier. You should 100% be playing"
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 3,
    "username": "oni desu",
    "details": "After playing for a few months my experience has been pretty bad, everything was fine the characters the gameplay all great also amazing skins. But here's my problem, every patch the game performance has been decreasing, i can't play on the highest graphics settings, the frame rate drops sometimes, and it's been heating up my phone so bad it actually forces my phone to restart and i can't play more than 20 minutes without worrying my phone could possibly burnt. Dev please optimize the game thx."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 5,
    "username": "Milinyr",
    "details": "I give this game a high rating because this is my kind of game. It's simple to play. The anime graphic style is nice. And most of all, I like the character designs and their stories. The main plot and the side stories are great - they give us more insights of the characters we're playing. I intend to stay in this game for a while, and I hope it grows more. The game has the potential. Some people say the game is grinding, but for me, the grinding is okay. Just take your time and enjoy the game."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 1,
    "username": "Wor Ezonac",
    "details": "Ridiculous. Five minutes in game and the app just suddenly went white screen and nothing happens. Another disappointing game. ----------------------------------------------- Update: Tried again after trying basic troubleshooting and yet the Next, Enter and Confirm buttons for dungeons won't work properly no matter how many times I tap it. They focused too much on character designs and poorly developed the game stability. 🗑️ Game."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 3,
    "username": "Kali&Antoine Simbler",
    "details": "Idk if the game constantly crashing is entirely exclusive to my experience, but with a ton of space on my phone and a good Internet connection, I have too deal with it 24/7. Aside from that, the game itself is likewise decent but I find a lot of the problems I had were entirely based on that... So far."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 4,
    "username": "Farrian Scott",
    "details": "I've been playing Outerplane for a while now, and I'm really loving the game and its characters! The gameplay is engaging, and the art is fantastic. I do hope for more quality-of-life updates, like recommended gear for characters and detailed guides explaining why certain gear works best. It would make building teams much easier. Keep up the great work!"
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 2,
    "username": "Michael Mays",
    "details": "Recently tried this game out again, and was immediately reminded why I stopped playing. Drop rates for the gacha portion of the game are *abysmal*. It's unfortunate because the game itself, the graphics, and the voice acting are all decent. But I'm near endgame and I'm stuck because I need a character that I don't have, and I have not gotten any decent ones in a LOT of pulls..."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 3,
    "username": "Carlos Jonathan",
    "details": "I've been playing the game since last year, and I really hate that they make it impossible to get the best reward in each event. The Reaper and The Gangster had a sick difficulty level, just like the previous event, and now, in this one the most you can get is 1,200 Kappa Chocolates and the Kappa suit costs 1,500. I don't know if there's another way to get the tokens that they don't mention it or if the developers just make it unattainable. 😭💔"
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 1,
    "username": "Chris Martorana",
    "details": "I experienced an error where I couldn't log into my account, and instead of helping me recover it, customer service just told me to turn it off and on again with no way of contacting them to keep the process going. I was looking forward to trying this game, but since I can't get into my account, I'll be uninstalling it. I'm not sending a bunch of messages back and forth with people unwilling to help"
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 2,
    "username": "Khairul Krax",
    "details": "Awesome game, but technical wise very laggy, response takes 3-8 seconds. I'm using S22, 256GB/12GB. No issues with higher specs games, but this game.... kinda laggy. If not fixed asap, will have to uninstall the game cause it's kind of frustrating to click and wait 3-8 sec every single time. UPDATE: the game still buggy and have to wait 3-8 seconds after clicking, even after recent update, awesome game to be honest. I played other games currently with no lags or whatsoever. Uninstalled."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 2,
    "username": "Sergej Tatalovic",
    "details": "Drop rates are way too low for the price they expect you to pay for pulls. Forget about free 2 play or being a low spender if you want to play this. Just did a 70 pull and didn't get a single 3 star, so i'd say the game is not worth spending money on at all, when other games exist that are a lot more generous. Looks good, plays good, but the value for your money is not there, stay away."
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 5,
    "username": "Eko Pratama",
    "details": "Good game they have been very generous in their reward and the power cap in the game is not that high, only playing this game for 1-2 month and I have a lot of character that reached max level. the only thing that frustrated me though is that this game have some ridiculous unfair bosses to fight and unless you have some really specific character the game just tell you \"you can't win\""
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 5,
    "username": "CasmaDoLuna",
    "details": "Excellent game I just love it, I've started playing for already a month and it's just very good, there's a lot to do, very interesting gameplays and the animations !! It's just peak ! This is the first time I'm seeing this kind of animations and I'm not on my first gacha game ! I find it kinda f2p too, so it making me wanna play more. Maybe the only thing that bothering me it's that it's VERY long to load the game and we can't go back to it after going on another app to answer a message ect"
  },
  {
    "id": "googlecom.smilegate.outerplane.stove.google",
    "review_score": 5,
    "username": "Glenn Glorious",
    "details": "I just started playing, however I have to say the beginning really draws you in! It's a great way to establish your gaming world and makes it personal to the player. I love the graphics - the facial expressions and character model motion is realistic and/or makes perfect sense for the scene. I'm excited to see how this all unfolds! Good luck to you all =^_^="
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 1,
    "username": "Cosmo Jones",
    "details": "I have been using Duolingo since 2012, for the last decade. It has been an amazing application and experience. Those days are over. Like any other legacy product they are trying to monetize it instead of modernizing it. I was a paid member for a long time and then when they wanted to up my rates by tacking on AI, that was the end of me paying for Duolingo. Since I'm already paying for other AI applications, I have a great experience with them. Improving my Spanish. Bye Duo. Ya got greedy."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 3,
    "username": "Tanner “T-Rex” Chambless",
    "details": "I do like duolingo but there are some issues. I paid for the year of base version. You really only get extra lives and no ads. My biggest issue is they hardly explain anything. Many things don't make sense without at least a basic explanation. You'll realize when you make a mistake it has a link to explain the mistake but you have to pay for the max version. No discount (that I'm seeing) even though I've already bought the base. You would think basic explanations would be included at least."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 1,
    "username": "Felina Tanner",
    "details": "I thought the advertising was bad before, it's gotten even worse. After every single lesson, whether it's math, music or language, there are 2 ads, one for another product, and one for Duolingo super. If you had an option to purchase a feature that just got rid of ads, I would pay for that, but, I WILL NEVER WASTE MY MONEY ON SUPER!!! I like having hearts, so there's actually some sort of incentive to do well. Also, bring back practice for hearts, practicing is a very important part of learning."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "Michael Sullens (ItenerantMonk)",
    "details": "This app is really handy and makes learning the basics of learning new languages easy... BUT it does an absolutely abysmal job of explaining any form of conjugation (read: it doesn't even try), only penalizes you for not guessing the proper conjugation when you've been exposed to both forms without any explanation at all as to when one or the other apply. If this were fixed, it would be a great app and get 5 stars. As it isn't and is a major issue when it comes to the learning of languages, two."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 1,
    "username": "Michael Wichhart",
    "details": "I'm no longer able to practice for more than one heart. They also messed with multipliers running out and no more streak freezes from chests. The pop-up ads have become loud, long and intolerable. New exercises have you gambling on what the right answer is, even when there should be multiple possibilities. The free version is no longer what it once was. It's as if they're annoying you to upgrade to the paid version. I have a 3 year streak, yet with the new updates I am no longer a happy user."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "Do as I say Not as I do!",
    "details": "Edit: so, they changed the ability to just practice which the worst update they could've done. One main reason I loved it was the ability to just practice, HOWEVER learning a new language is hard enough but forcing you to move forward when your not ready or lose your streak. They need to change it back. Other updates are fine but they should have never changed practice😞 Original (part): Love it. I keep forgetting you can tap on the words to get the translation. They don't make that an issue."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 1,
    "username": "Victoria Bain",
    "details": "Edit: Be aware that when using the free trial and it shows that the cost will then be £4.99/month £59.99 in total, they actually take £59.99 out of your account and not the £4.99 per month!!! So unhappy to have a huge chunk of money taken that i was not expecting. Only google play can refund, Duo dont deal with it! I am really enjoying it. Though I keep getting an error when I try the speaking exercises and despite trying every suggestion to fix it, I just can't fix it."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "John Stathopoulos",
    "details": "I enjoy the gamification of Duolingo and bought Plus for no ads. This is a complete lie - advertising for their other subscriptions is everywhere. I will not be renewing. Other than that, it works as intended. It can be a fun way to learn the language. However, an improvement I would recommend is making you write a sentence on your own - it's too easy to piece them together with the word tiles provided. If you know a few words you can guess the others which doesn't feel like real learning"
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 1,
    "username": "Sourabh Das",
    "details": "The latest update is full of bugs, makes the experience worse, and makes it harder to learn with the hearts system. It has bugged out multiple times, with the keyboard crashing so I had to exit out of a lesson, the app failing to track progress, not being able to start lessons, not being able to change settings etc. There are core lessons that are being blocked now and requiring the paid subscription to access. It's wild that they still advertise themselves as a 'free' language learning app."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "Woollen It Be Lovely",
    "details": "I enjoy using this app, but there are a few problems. It doesn't explain grammar or sentence structure, so you just hope you can pick it up. They have also taken away the ability to win back hearts by doing practice lessons, so you have to pay a high gem price or wait 24hrs to get full hearts again, and the monthly price is too high. If it was £6 or £7 a month, I'd be tempted to subscribe, but not ay £10! The adverts have gotten worse, they are very loud, and I'm beginning to want to leave."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 1,
    "username": "Robert Taylor",
    "details": "Not so slowly starting to make the free version unusable. 5 hearts, no way to get them back, with bugs in the ai powered lessons that fail you before you even get a chance to try. || The game-ification sounds good at first but it's predatory in nature and designed to get you to spend gems. Not to mention it's easy to lose yourself in the 'game' and forget to actually learn as opposed to just racking up xp to top leaderboards or slam out as many lessons as possible to get more xp during boost."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 4,
    "username": "The Psychotic Squad 666",
    "details": "Outstanding app. I've been learning Italian for just over 30 days, and I'm fairly confident with simple sentences. The app keeps on your case (if you enable it to) to keep your streak going. The pronunciation lessons are a bit of a pain as it doesn't pick up what I say, but I've only had one penalty due to that issue. The other gripe is that there's one feature you cannot access without a paid subscription. I understand why, but it's a pain none of the less."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "Alicia Ruth",
    "details": "I used to love this app but they've made it nearly unusable. It's just constantly trying to get you to buy and use things for points, freezes, etc. You can't just use the app without being forced to participate in tedious annoying stuff that derails your learning. I paid for a subscription for years and finally canceled it because it's gotten so unpleasant to use. Edit: Took off another star, they somehow managed to make it even worse while doing absolutely nothing to make the courses better."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "Shane Douglas",
    "details": "The option to opt out or into the weekly leader boards as desired would be appreciated, as that part adds a bit of stress to the fun of learning, which makes it less fun sometimes. They also keep changing how many people get demoted and promoted in each league, which randomly adds an extra element of stress as well. Slowly becoming less and less of a fan each time these get changed."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 5,
    "username": "Russell Carey",
    "details": "Fun, gamified language learning, but I would say it's a great \"starter\" app for learning a new language, not if you want to develop deep understanding or expertise in a new language. It's good for learning vocabulary. After talking with several of my Spanish speaking friends, it's not always accurate, and the example phrases are sometimes bizarre, but I get why they do the silly phrases. Overall, it's been a fantastic family learning tool for my wife and kids."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "John Ingle",
    "details": "Fun interactive experience marred by ads. There are so many ads, the Duolingo ones are the worst as they are loud, obnoxious and after every lesson. Constant messaging and pressure that is in your face nonstop unless you disable all notifications. Duolingo is the overly friendly ex that doesn't understand you need space and is constantly interjecting themselves every opportunity to \"help\". The high pressure sales tactics might appeal to some, for me it just made me anxious and stressed."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 3,
    "username": "Mason Johnson",
    "details": "While Duolingo is not the best method for learning a language out there, it has really helped me personally get much more familiar with reading and speaking several languages. Many of the updates for different activities have been helpful additions. However, the entire social aspect and the notifications have become so painfully twee and intrusive that it actually makes me want to leave- I would have canceled had I not already been billed for my supporter fee (which should be used better!)"
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 5,
    "username": "Kirana Kepakisan",
    "details": "I was a bit skeptical to use Duolingo again after the whole revamp thing, and after i heard they got ads now. but turns out it's still great, the ads are only after lessons, and right after i finish my super free trial, they immediately offered me another week free??? i don't know if this is a mistake on their part but i'm glad i'm able to learn a new language on a budget."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 1,
    "username": "Matt Meloan",
    "details": "I'm currently on a 276 day streak, and only using this app because I'm not aware of anything better yet. I've been learning Danish, and feel like a beta tester because I can't seem to go a day without finding 2-3 mistakes in hints, English grammar, etc. It just feels lazy and poorly maintained, and there's problems that have gone for years without being fixed, like bad audio quality when you hit the button for slow playback."
  },
  {
    "id": "googlecom.duolingo",
    "review_score": 2,
    "username": "Bojana B.",
    "details": "I'm editing my once positive review because the recent changes have made the app almost unrecognizable and the learning experience no longer satisfying or enjoyable. There used to be great grammar tips for each lesson, which are now almost completely gone. The grammar tips that are left are not helpful at all. Also, the rewarding system glitches too often and nobody ever responds to the complaints. I missed out on the daily chest rewards too many times and it's frustrating to say the least."
  }
]